[
  {
    "id": "2a45bab1-5ec4-4d2e-b245-27a142a78890",
    "code": "IS215",
    "name": "Digital Business - Technologies and Transformation",
    "description": "This course introduces students to the fundamentals of digital business, technologies and the principles and practices that lead to successful digital transformation. With the exploitation of digital technologies such as artificial intelligence, cloud, analytics, mobile networks, social media, and the Internet of Things, organizations can develop a competitive edge that can boost efficiency and drive new business models that lead to an increase in the top and bottom lines. The course focuses on digital strategies using four components namely reimagining the business, re-evaluating value chain, reconnecting with customers and rebuilding the organisation. Challenges such as data security and governance, regulatory constraints, and future directions of digital business will be discussed. Besides helping students to understand the key concepts, tools and API services are introduced to implement the digital and analytics solutions. Real world examples and case studies of how organizations innovate and drive digital transformation will also be covered.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 4,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "77526d76-f88c-4e82-91d7-822a2c658ea8",
    "code": "MGMT214",
    "name": "Management and Leadership: A Seminar with CEOs",
    "description": "This course is designed to give students opportunities to listen to and interact with about 12 CEOs/MDs each semester.  The invited speakers will share with students their views on leadership and management.",
    "creditUnits": 0.5,
    "belongToUniversityId": 1,
    "belongToFacultyId": 1,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "be218806-51fa-49aa-bd78-8367bd976e81",
    "code": "ACCT102",
    "name": "Management Accounting",
    "description": "This course introduces cost and management accounting topics to enable students to understand how accounting information is used to manage an organisation. It focuses on the factors that differentiate one company from another. The course will look at various functional areas within the firm, ranging from manufacturing to marketing, and from accounting to human relations. In addition, the concept of management, how senior managers plan, implement and control those plans through people will be briefly discussed. The course will enhance students' personal skills in preparation for more advanced courses at the university in the following ways: working in groups, analysing cases, writing reports, and making presentations.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 6,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "7769415c-d9f3-44c1-8ead-b54d937e8978",
    "code": "COMM662",
    "name": "Management Communication",
    "description": "Management Communication equips students with strategies that will enable them to successfully communicate their solutions to organizational problems. Since the course emphasizes the importance of effective written and spoken communication within a business setting, students will be exposed to strategies that will enable them to communicate their ideas and values in a clear, persuasive and memorable way. Students will, therefore, learn the art of producing impactful business documents and delivering engaging presentations in various business contexts.  By the end of the course, students will be able to function as proficient communicators who are ready to embrace the communicative challenges inherent in today’s dynamic business environment.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 1,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "c229563a-4361-4b4a-8c89-346d0c6c6553",
    "code": "COR-IS1702",
    "name": "Computational Thinking",
    "description": "Computational Thinking equips students to tackle complex computational problems; it trains students to design solutions to solve those problems using a computer program.  It draws upon concepts from mathematics and computer science – more precisely, discrete mathematics, data structures and algorithm design.\n\nThis course will hone students’ analytical skills as they are challenged to think abstractly and computationally. Their minds will be open to the wonders of computing, as they go behind the scene to unravel the fundamental analytics that empower Google, consulting agencies and service companies.\n\nNOTE: To facilitate learning in this course, you are required to know and use programming.  You are advised to pick up the Python programming language before the course, for instance by practising with online tutorials such as http://learnpython.org.\n\nBy taking this course, students will:\n• discover the science of computing\n• model problems and learn practical problem-solving techniques to tackle complex computational problems (beyond what a spreadsheet is capable of solving)\n• apply problem-solving techniques to develop more elegant and efficient programs\n• learn to write programs to represent and manipulate with complex data objects\n• understand the challenge of scale, not only in dealing with large data sets, but also in appreciating the nature of computing and computability",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 4,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "add72ffa-9d36-42e4-8c49-b74b007c0841",
    "code": "CS301",
    "name": "IT Solution Architecture",
    "description": "The IT Solution Architecture course integrates design concepts and methods to develop IT solutions from both the software and system-level perspectives.  It focuses on the analysis, design and implementation of an IT solution through which business requirements, software qualities and solution elements are transformed into implementable artefacts.  By combining critical analysis with hands-on design and development, the course prepares students to participate effectively in the architecture design and development stages of a software-intensive IT solution project.\n\nIt is highly recommended that students are also proficient in IS442 Object Oriented Programming and Java programming language prior to reading this course.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 4,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "48573ec4-8371-44b9-9294-621c39627372",
    "code": "LAW429",
    "name": "Corporate Insolvency Law",
    "description": "Insolvency law is concerned with debtors who are unable to repay their debts. This course will consider the rules and processes which the law has developed to address this ever-present problem, with a focus on debtors which are companies. In particular it will cover, in more depth than in LAW205, the formal processes available in Singapore – receivership, schemes of arrangement, judicial management and liquidation (winding up). In those contexts, the substantive policies and principles of the law will be addressed – e.g. , the pari passu principle, the concept of set-off, and the avoidance of suspect transactions entered in the run-up to insolvency. In addition, the course will consider informal debt restructurings (work-outs), and also introduce the issues and developing law relating to cross-border insolvencies. As well as providing a theoretical grounding in corporate insolvency principles, it is expected that aspects of the course will involve the participation of specialist insolvency lawyers from private practice, with the aim of providing a practical perspective.\nAlthough the primary focus will be on corporate insolvency, comparison will be made with the procedures and rules applicable in the bankruptcy of individuals. It is likely that before or during the period of the course the Government will publish a draft Insolvency Bill combining and amending the rules applicable to both individual and corporate insolvency. If so, the course will take those proposals into account.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 2,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "029b2258-ee2c-415d-a29d-be84babe1896",
    "code": "MGMT6038",
    "name": "Data Visualization and Communication",
    "description": "Future HR professionals must be able to explain HR issues in business language to help in making people decisions. No professional in the field can expect to succeed in his or her career without the ability to build a solid business case, built on evidence, insights and a compelling story.\n\nTo implement their organisation’s strategies effectively, it is imperative that HR provide data-driven answers and insights on how to implement and execute strategy through the people in the organization. The organisations that will win the “war for talent” will be those which are better at identifying and keeping key talent, motivating high performance, developing and promoting staff and accurately predicting future people needs. HR professionals need to persuade business leaders of the need for HR interventions and practices to address these challenges.\n\nThis programme provides participants with practical, hands-on approaches to connect HR policies and practices to business performance. Working with accessible tools such as Excel, we will practice building descriptive and predictive models, review the key tenets of building business cases and crafting a compelling story using simple yet effective data visualization techniques. The course will allow you to get hands-on experience in approaches for workforce planning, recruitment, compensation, training, employee engagement, career planning and turnover. We will also do practical exercises in class involving “real” data. At the end of the course, you will be able to put these skills and tools to good use.\n\nThe course also includes a visit to a local company to review how they do HR Analytics, the HR Operations that supports it, and how the data is put to use to address business problems.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 1,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "7687fd3b-cc0d-4cba-911f-efde99e864d2",
    "code": "OBHR300",
    "name": "Human Resources Analytics",
    "description": "The future of the HR profession lies in analytics. No professional entering the field can expect to succeed in his or her career without a solid understanding and hands-on practice of analytical tools to help in making people decisions.\n\nTo implement their business strategies effectively, leaders must deal with people issues in a way that allows them to gain competitive advantage through people. The organizations that will win the “war for talent” will be those which are better at identifying and keeping key talent, motivating high performance, developing and promoting staff and predicting future people needs accurately. HR professionals need analytics to address these challenges. For exam-ple, linking pay-for-performance has been a dogma of management, but recent research shows that most incentive plans do not produce the desired behavior, and that pay, in fact, has little correlation to business results.\n\nTo succeed in the business world, it is imperative that HR provide data-driven answers and insights on how to implement and execute strategy through the people in the organization. The course provides students with practi-cal, hands-on approaches to connect HR policies and practices to business performance. You will review key statis-tics and finance concepts, such as ROI and people productivity; become familiar with available tools such as Workday and Tableau to complement Excel and others; discuss data collection, clean-up and warehousing; prac-tice building descriptive and predictive models; and get hands-on experience in applications for workforce planning, recruitment, compensation, training, career planning and turnover. At the end of the semester, you will be able to put HR analytics skills and tools to good use.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 1,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "fd81b8b9-c7eb-4978-900a-eaba16398dde",
    "code": "PSYC603",
    "name": "General Linear Model",
    "description": "This course covers both theory and application of techniques such as univariate analysis of variance and covariance, nonparametric methods, correlations, and linear regression.  Students will learn about the underlying assumptions of each statistical model as well as significance testing, estimating effect sizes, and statistical power.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 5,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "55d4ee64-4e82-4963-97b3-38edfdb161e6",
    "code": "QF609",
    "name": "Risk Analysis",
    "description": "This module concentrates on approaches to measuring and controlling market risk and credit risk, and also touches on the regulatory framework and the reasons behind the increase of importance of this discipline over the last 10 years.\n\nThe students will learn to analyse and quantify risk according to current best practice in the markets, including the RiskMetrics and CreditMetrics methodologies.\n\nThe module looks at risk analysis both from a mathematical and an empirical point of view as well as from the viewpoint of practitioners.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 1,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "e37b1881-dcc9-4c81-a82a-cdca512cfb6f",
    "code": "SE101",
    "name": "Operating Systems and Networking",
    "description": "This is a hybrid course that aims to equip students with foundational knowledge on operating systems and computer networking.\n\nOperating Systems: knowledge of the mainstream operating systems, Microsoft Windows and Linux, security and access control strategies, shell commands and scripting, as well as enterprise-level features of various OSes. Students should be able to demonstrate ability to compare and contrast these two OSes. Students should also be comfortable with using the command line interface, including skills to troubleshoot issues pertaining to environment variables and misbehaving applications. Students should also get experience with installing Windows and Linux from scratch either on a real laptop/PC or a virtual machine.\n\nNetworking: foundational networking concepts useful for programming, including TCP/IP concepts, ports, routing concepts, basic network-related security issues. Students are expected to work on real switches and routers as well as set up a simple LAN, configure the network settings for Windows, Linux, and optionally MacOS machines, to join this network, and perform basic network-related troubleshooting. Students should also be able to appreciate how the Internet works, including knowledge on DNS, gateways, the client/server architecture of Web servers and how a packet is routed from origin to destination. Students should also be able to write simple high-level programs in Python that communicate across the network.\n\nThis course is specially designed to be industry-focused with hands-on practice.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 4,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "53a486bb-c4e6-4795-a359-febfce39586d",
    "code": "STAT203",
    "name": "Financial Mathematics",
    "description": "This course covers the following topics:\n1) Introduction to interest rate, present value and future value, present value of cash flows and annuities\n2) Payment interval and interest-conversion interval, non-level annuities\n3) Spot rates, forward rates and the term structure\n4) Rates of return, internal rate of return (yield rate) and other measures of return\n5) Loans, amortization schedule and sinking fund\n6) Bonds and bond pricing\n7) Bond yield and the term structure\n8) Bond management, duration, convexity and immunization\n9) Futures, forward contracts, options and swaps",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 3,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "5c3443df-9038-4706-a727-eae9bdb77642",
    "code": "PPPM201",
    "name": "Environmental Policy",
    "description": "This course introduces students to environmental  policies at the local, national, and supranational level. The course analyses alternative views concerning problems of climate change with specific attention paid to social, political, and economic issues and discourses pertaining to energy, air and water pollution, food waste and plastics, biodiversity and deforestation. The course also addresses major controversies regarding values, institutions, public opinion, and education, the role of business and society, environmental risk, competing approaches to regulation, environmental justice, sovereignty, and non-traditional security issues.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 5,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  },
  {
    "id": "441e3d23-2257-4295-b145-b66b792af7bc",
    "code": "POSC206",
    "name": "Politics of Japan and Korea",
    "description": "This course introduces students to politics and public policies in contemporary Japan and Korea. Japan was the first non-Western country to industrialize and to establish the democratic institutions. However, unlike most Western democracies, Japan maintained a mixture of democratic procedures, one-party dominance, alliance with U.S. military, high-level of economic growth, and social security from 1955 to 1993. Since to early 1993, many of mainstays of the previous system have collapsed and new institutions have established: coalition government, electoral reform, the bubble economy, etc. Following the experience of ‘Japanese miracle,’ the second half of the twentieth century has seen South Korea transformed from an impoverished, war-ravaged nation to one of the most successful economies in East Asian region. This has been accompanied by a political transformation from a military authoritarian regime to a vibrant democracy. While most analyses of Korean politics have looked to elites to explain political change, this course is designed to examine new challenges to political power structure of Korea in the age of transformation.",
    "creditUnits": 1.0,
    "belongToUniversityId": 1,
    "belongToFacultyId": 5,
    "createdAt": "2024-03-14T04:03:32.443Z",
    "updatedAt": "2024-03-14T04:03:32.443Z"
  }
]
